#+title: notes/jansson
<2022-04-19 Tue>
** Output
Execute this code block =C-c C-c= to tangle, compile, and execute the above code block

#+begin_src sh :results output
  #!/bin/sh

  # Exit on command failure
  set -e

  SRC=hello_jannson_csv_parser.c
  OUTPUT=hello_jannson_csv_parser

  ../../config/tangle.sh jansson.org

  cd ~/tmp
  gcc -o $OUTPUT $SRC -ljansson

  ./$OUTPUT
#+end_src

#+RESULTS:
#+begin_example
{
  "foods": {
    "produce": {
      "fruits": {
	"apples": [
	  {
	    "name": "Honey Crisp",
	    "data": "ABC"
	  },
	  {
	    "name": "Gala",
	    "data": "DEF"
	  },
	  {
	    "name": "Granny Smith",
	    "data": "GHI"
	  }
	],
	"oranges": [
	  {
	    "name": "Tangerine",
	    "data": "JKL"
	  },
	  {
	    "name": "Navel",
	    "data": "MNO"
	  },
	  {
	    "name": "Clementine",
	    "data": "PQR"
	  }
	]
      }
    },
    "meats": {
      "poultry": {
	"chicken": [
	  {
	    "name": "Wings",
	    "data": "STU"
	  }
	],
	"turkey": [
	  {
	    "name": "Legs",
	    "data": "VWX"
	  }
	]
      },
      "pork": {
	"bacon": [
	  {
	    "name": "Thick Cut",
	    "data": "YZA"
	  }
	],
	"ham": [
	  {
	    "name": "Glazed",
	    "data": "BCD"
	  }
	]
      }
    }
  }
}
#+end_example
